# LoadFrom Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CADLinkType..::..LoadFrom Method
CADLinkType Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LoadFrom(String) | Loads or reloads the DWG link from the given file path. |
| LoadFrom(ExternalResourceReference) | Loads or reloads the DWG link from the given external resource reference. |

# See Also
CADLinkType Class
CADLinkType Members
Autodesk.Revit.DB Namespace